{
  "blogs": [
    {
      "title": "Trip to Chandragiri",
      "body": "Chandragiri Hill is an old trading route for merchants. It is also a route for people who used to travel from one city to another. Because of the hill, people would walk up for hours before they could reach the top. They would then go back down the mountain. After many years, this place became a resting spot for Pritiv Narayan Shah who, after looking at the view, decided to take over the Kathmandu valley and rule it as his own. As of 2016, this site has been renovated to become one of the most famous tourist spots in all of Nepal. It is a must-go place with lots of attractions, views, and even a temple for Hindus.The journey from the bottom of the valley to the top of the hill has a different atmosphere. It puts into perspective how small we all are. The warm climate of Nepal also helps keep even the fog-covered top of the hill pretty warm. It is also accessible to people of all ages. While there is a bit of a climb to get to the very top of the hill, the scenic view is worth every second of it.",
      "author": "Abhinaba",
      "id": 1
    },
    {
      "title": "Trip to Puri",
      "body": "ne Diwali Vacation, I decided to go on a trip to see the ocean with my parents. Destination Puri was selected and a four day trip was chalked out.  The scenery was pretty much alike to that en route Kolkata (my homeland)….All small ponds, coconut trees, ponds full of lotus plants……Unlike the barren and dusty route when one goes towards Pune/Nagpur….As the train sped towards Cuttack, we crossed the 2,250 m long bridge built on the river Mahanadi. It was awesome. After dealing with agents and browsing through pamphlets we decided on a cottage type hotel. It was a good bargain and right on the beach with the ocean 30 metres away.In the late afternoon of the day we arrived, my parents went to see the ocean while i kept sleeping. Then we again went for a stroll after dark and the beach light being out of order, it was quite scary to walk across beach in darkness..And then I got the night view of Bay of Bengal…..Looking so omnious in night..A dark unknown water world…So wild and powerful. Then later we went for a quick ride around the city.",
      "author": "Sanchita",
      "id": 2
    },
    {
      "title": "Trip to Debigarh",
      "body": "No proper roads, no navigation, no internet, barely any telephone network inside a dense forest, some of the clearest waters & bluest skies you’ll see in India… & hidden waterfalls which even most locals are unaware of.No proper roads, no navigation, no internet, barely any telephone network inside a dense forest, some of the clearest waters & bluest skies you’ll see in India… & hidden waterfalls which even most locals are unaware of.Situated along the western borders of Odisha (India), Debrigarh is truly a hidden gem & a heaven for adventure enthusiasts. It’s to be seen to be believed.Stretching as far as 55kms across 3 districts, Hirakud Dam at 25.8km is one of the longest earthen dams in the world. Situated on the bank of it, Debrigarh is still a lesser known area on Odisha’s tourist map. Very few natives have heard about it & those who have, hardly have any idea of the sheer natural beauty that lies within. So, don’t be surprised if you ask about Debrigarh to an Odia & they are just as clueless as you.The sanctuary has two major entry points in the districts of Bargarh & Sambalpur. Where the latter is a tourist hotspot & boasts of a beautiful eco-lodge by the water… not many people (not even from Bargarh) venture into the sanctuary from the other route. Roads die down the moment you enter the forest & if you’re going deep inside… only practical mean of exploring can be a Royal Enfield or any other powerful bike. Even that… will give up on a few occasions & you will be on your own (not kidding).The Bargarh-Ambabhona route is surprisingly in great condition, with negligible traffic. I was fortunate enough to be able to locate 3 waterfalls, each one more beautiful than the other.HOW TO REACH:The forest is known to be home to elephants, leopards & more than a dozen other wild animal species (tribals also talk about a tiger). You’d be wise to start off from Bargarh as early after sunrise as possible. Take the Ambabhona route & head to Nalichuan village (26km from Bargarh) at the edge of the sanctuary. Roads are surprisingly in really good condition for the first 20 odd kms before you take a detour. Nalichuan village is till where you can take a car.Beyond Nalichuan, you will be totally on your own. Make sure the tyre pressure is adequate on your bike; you have enough fuel & refreshments to last a day. Deeper you go… more magical are the waterfalls. Untouched, unexplored & on most days you will have the entire waterfall to yourself. Due to the rain-water flowing through rocky terrains… water remains cold, fairly clean & perfect for a dip. Be watchful of the sharp rocks & fishes at the bottom though!BEST TIME TO VISITThese are seasonal waterfalls & only come to life in the rainy season. Best time to visit would be July-Aug-Sept. By November the waterfalls run dry!",
      "author": "Shruti",
      "id": 3
    },
    {
      "title": "Trip to Chausathi Yogini Temple",
      "body": "My initial part of life was in my village Sagua (Was called as Sakambaripur in ancient times). The nearby village is Hirapur (Was called as Hiradeipur in ancient times). Sagua is a sub-village under Hirapur.\n\nThe people from the villages are either into job sector, business or Bronze/Brass art.\n\nI started my school career in Hirapur School. The school building was a few asbestos houses that time. In the school campus, there were multiple Jhaaun Trees (Casuarina) planted in a nice fashion. There was a petty shop nearby where we used to get 10paise biscuits and 10 paise Ghuguni (Matar Curry).\n\nAnd the shop owner also had a Narakoli tree in his boundary. He used to pluck the fruits from the tree and sell there itself.\n\nNow though the school building is a pucca building and the shop is not there, still the old picture is printed in my mind.\n\nWhile returning to home, we sometimes used to go to the nearby temple.\n\nWe call the temple as “Mahamaya mandira” or “Chausathi jogini mandira”. In the temple campus, there is a Siva temple at the entrance and in the main temple there is the statue of 64 Joginis/Yoginis (Goddesses). In front of the temple, there is a big pond called as “Mahamaya gaadia/pokhari”. At the center of the pond, there is a small temple like elevation called as “Dipidandi”. The 64 Yogini main temple is a hypaethral (no roof) structure. But I did not know that time why the temple had no roof. I remember, even in that time some foreign tourists used to come to see the temple. I was surprised that time as to why tourists used to come. Always I had this question whether it is a tourist spot? I could not think my place as a tourist destination as I used to see the village and the temple daily.",
      "author": "Jasmin ",
      "id": 4
    }
  ]
}